import re

str = re.sub(r'(\d+일전$|이틀전$|하루전$|오늘$)', '', '094-동아리 94화 1일전')
print('📢[test.py:4]: ', str)
str = re.sub(r'(\d+일전$|이틀전$|하루전$|오늘$)', '', '094-동아리 94화 10일전')
print('📢[test.py:4]: ', str)
str = re.sub(r'([0-9]+일전$|이틀전$|하루전$|오늘$)', '', '094-동아리 94화 120일전')
print('📢[test.py:4]: ', str)
str = re.sub(r'(.일전$|하루전$|어제$|오늘$)', '', '094-동아리 94화 오늘')
print('📢[test.py:6]: ', str)
str = re.sub(r'(.일전$|하루전$|어제$|오늘$)', '', '094-동아리 94화 어제')
print('📢[test.py:8]: ', str)
str = re.sub(r'(.일전$|하루전$|어제$|오늘$)', '', '094-동아리 94화 1일전')
print('📢[test.py:5]: ', str)
